from utils import _query

data1 = {"m": "QNT-ETH", "i": "4ed18180-53bc-3c7d-949b-4a4f20decaff", "p": "0.01955500", "q": "47.96743402",
         "Q": "0.93800317", "t": 1614789825785, "s": "buy", "u": 5750}
data2 = {"type": "trades",
         "data": {"m": "QNT-ETH", "i": "cc9c2d71-c485-3f97-8d0b-f05b30af6ce7", "p": "0.01860195", "q": "262.09769790",
                  "Q": "4.87552827", "t": 1614780061225, "s": "buy", "u": 5749}}

'''
Продажа - цена c IDEX: 0.02120001 -> цена на Kyber: 0.021073383202865073 = QNT -0.60%
'''





save_log(data2)

